uhnp/src/InformationRegisters/ПравилаКонвертацииXSD/ПравилаКонвертацииXSD.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПравилаКонвертацииXSD</name>
  <resources>
    <name>ТекстПравил</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ХэшCRC32</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПравилаКонвертацииXSD</name>
    <type>
      <types>CatalogRef.ПравилаКонвертацииXSD</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерРедакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПравилаКонвертацииXSD/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ПрограммныйИнтерфейс


// Возвращает текст правил последней редакции.
//
// Параметры:
//  ПравилаКонвертацииXSD - СправочникСсылка.ПравилаКонвертацииXSD -
//			классификатор правил конвертации XSD.
//
// Возвращает:
//	- Неопределено - переданы неверные параметры, или правил нет.
//	- Структура - описывает правила:
//		- ТекстПравил - Строка - строка с текстом правил.
//		- НомерРедакции - Число - номер редакции правил.
//		- ХэшCRC32 - Число - хэш CRC32 для текста правил.
//
Функция ПолучитьПоследнююРедакцию(ПравилаКонвертацииXSD) Экспорт
	Если НЕ ЗначениеЗаполнено(ПравилаКонвертацииXSD) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(РегистрПравилаКонвертацииXSD.НомерРедакции) КАК НомерРедакции
		|ПОМЕСТИТЬ МаксНомерРедакции
		|ИЗ
		|	РегистрСведений.ПравилаКонвертацииXSD КАК РегистрПравилаКонвертацииXSD
		|ГДЕ
		|	РегистрПравилаКонвертацииXSD.ПравилаКонвертацииXSD = &ПравилаКонвертацииXSD
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РегистрПравилаКонвертацииXSD.ТекстПравил КАК ТекстПравил,
		|	РегистрПравилаКонвертацииXSD.НомерРедакции КАК НомерРедакции,
		|	РегистрПравилаКонвертацииXSD.ХэшCRC32 КАК ХэшCRC32
		|ИЗ
		|	РегистрСведений.ПравилаКонвертацииXSD КАК РегистрПравилаКонвертацииXSD
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксНомерРедакции КАК МаксНомерРедакции
		|		ПО РегистрПравилаКонвертацииXSD.НомерРедакции = МаксНомерРедакции.НомерРедакции
		|			И (РегистрПравилаКонвертацииXSD.ПравилаКонвертацииXSD = &ПравилаКонвертацииXSD)";
	Запрос.УстановитьПараметр("ПравилаКонвертацииXSD", ПравилаКонвертацииXSD);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = Новый Структура("ТекстПравил, НомерРедакции, ХэшCRC32");
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаДетальныеЗаписи);
		Возврат Результат;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

// Возвращает текст правил указанной редакции.
//
// Параметры:
//  ПравилаКонвертацииXSD - СправочникСсылка.ПравилаКонвертацииXSD -
//			классификатор правил конвертации XSD.
//  НомерРедакции - Число - номер редакции. Если не указан,
//			то берется последний номер редакции.
//
// Возвращает:
//	- Неопределено - переданы неверные параметры, или правил нет.
//	- Структура - описывает правила:
//		- ТекстПравил - Строка - строка с текстом правил.
//		- НомерРедакции - Число - номер редакции правил.
//		- ХэшCRC32 - Число - хэш CRC32 для текста правил.
//
Функция ПолучитьПравила(ПравилаКонвертацииXSD, НомерРедакции) Экспорт
	Если НЕ ЗначениеЗаполнено(ПравилаКонвертацииXSD)
			ИЛИ ТипЗнч(НомерРедакции) <> Тип("Число")
			ИЛИ НомерРедакции < 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрПравилаКонвертацииXSD.ТекстПравил КАК ТекстПравил,
		|	РегистрПравилаКонвертацииXSD.НомерРедакции КАК НомерРедакции,
		|	РегистрПравилаКонвертацииXSD.ХэшCRC32 КАК ХэшCRC32
		|ИЗ
		|	РегистрСведений.ПравилаКонвертацииXSD КАК РегистрПравилаКонвертацииXSD
		|ГДЕ
		|	РегистрПравилаКонвертацииXSD.НомерРедакции = &НомерРедакции
		|	И РегистрПравилаКонвертацииXSD.ПравилаКонвертацииXSD = &ПравилаКонвертацииXSD";
	Запрос.УстановитьПараметр("НомерРедакции", НомерРедакции);
	Запрос.УстановитьПараметр("ПравилаКонвертацииXSD", ПравилаКонвертацииXSD);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = Новый Структура("ТекстПравил, НомерРедакции, ХэшCRC32");
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаДетальныеЗаписи);
		Возврат Результат;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

// Записывает текст правил в регистр.
//
// Параметры:
//  ПравилаКонвертацииXSD - СправочникСсылка.ПравилаКонвертацииXSD -
//			классификатор правил конвертации XSD.
//  ТекстПравил - Строка - непустая строка с текстом правил.
//  НомерРедакции - Число - номер редакции. Если не указан,
//			то берется последний номер редакции.
//
// Возвращает:
//	Число - номер записанной редакции.
//		Если возникла ошибка, то возвращает 0.
//
Функция ЗаписатьПравила(ПравилаКонвертацииXSD,
							ТекстПравил,
							Знач НомерРедакции=Неопределено) Экспорт
	Если НЕ ЗначениеЗаполнено(ПравилаКонвертацииXSD) 
			ИЛИ ПустаяСтрока(ТекстПравил) Тогда
		Возврат 0;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(
		"РегистрСведений.ПравилаКонвертацииXSD");
	ЭлементБлокировки.УстановитьЗначение(
		"ПравилаКонвертацииXSD", ПравилаКонвертацииXSD);
	Блокировка.Заблокировать();
	Если ТипЗнч(НомерРедакции) <> Тип("Число") ИЛИ НомерРедакции < 1 Тогда
		НомерРедакции = ПолучитьТекущийНомерРедакции(ПравилаКонвертацииXSD);
		Если НомерРедакции = 0 Тогда
			НомерРедакции = 1;
		КонецЕсли;
	КонецЕсли;
	ЗаписатьПравилаВРегистр(ПравилаКонвертацииXSD, НомерРедакции, ТекстПравил);
	ЗафиксироватьТранзакцию();
	Возврат НомерРедакции;
КонецФункции

// Записывает текст правил в регистр с новым номером редакции.
//
// Параметры:
//  ПравилаКонвертацииXSD - СправочникСсылка.ПравилаКонвертацииXSD -
//			классификатор правил конвертации XSD.
//  ТекстПравил - Строка - непустая строка с текстом правил.
//
// Возвращает:
//	Число - номер записанной редакции.
//		Если возникла ошибка, то возвращает 0.
//
Функция ДобавитьПравилаВНовойРедакции(ПравилаКонвертацииXSD, ТекстПравил) Экспорт
	Если НЕ ЗначениеЗаполнено(ПравилаКонвертацииXSD) ИЛИ ПустаяСтрока(ТекстПравил) Тогда
		Возврат 0;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(
		"РегистрСведений.ПравилаКонвертацииXSD");
	ЭлементБлокировки.УстановитьЗначение(
		"ПравилаКонвертацииXSD", ПравилаКонвертацииXSD);
	Блокировка.Заблокировать();
	НомерРедакции = 1 + ПолучитьТекущийНомерРедакции(ПравилаКонвертацииXSD);
	ЗаписатьПравилаВРегистр(ПравилаКонвертацииXSD, НомерРедакции, ТекстПравил);
	ЗафиксироватьТранзакцию();
	Возврат НомерРедакции;
КонецФункции

// Проверяет, что в регистре есть правила конвертации указанного типа.
//
// Параметры:
//  ПравилаКонвертацииXSD - -
//  НомерРедакции - Число - необязательный, если нужно проверить,
//		что существует указанная версия правил. Если данный параметр
//		не передавать или установить в Неопределено, тогда будет
//		проверено наличие любой версии правил.
//  ХэшCRC32 - Число - необязательный, если нужно проверить,
//		что существует версия правил с указанным значением хэш-функции.
//		Если данный параметр не передавать или установить в Неопределено,
//		то будет проверено наличие правил без учета хэша.
// 
// Возвращаемое значение:
//   - Булево - Истина - есть правила, Ложь - нет правил.
//
Функция ЕстьПравила(ПравилаКонвертацииXSD,
					НомерРедакции=Неопределено,
					ХэшCRC32=Неопределено) Экспорт
	Если НЕ ЗначениеЗаполнено(ПравилаКонвертацииXSD)
			ИЛИ (ТипЗнч(НомерРедакции) = Тип("Число")
					И НомерРедакции < 1) Тогда
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	1 КАК ЕстьПравила
		|ИЗ
		|	РегистрСведений.ПравилаКонвертацииXSD КАК РегистрПравилаКонвертацииXSD
		|ГДЕ
		|	РегистрПравилаКонвертацииXSD.ПравилаКонвертацииXSD = &ПравилаКонвертацииXSD";
	Запрос.УстановитьПараметр("ПравилаКонвертацииXSD", ПравилаКонвертацииXSD);
	Если НомерРедакции <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
			|	И РегистрПравилаКонвертацииXSD.НомерРедакции = &НомерРедакции";
		Запрос.УстановитьПараметр("НомерРедакции", НомерРедакции);
	КонецЕсли;
	Если ХэшCRC32 <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
			|	И РегистрПравилаКонвертацииXSD.ХэшCRC32 = &ХэшCRC32";
		Запрос.УстановитьПараметр("ХэшCRC32", ХэшCRC32);
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
КонецФункции

// Возвращает номер текущей редакции правил.
// Если правила не записаны в регистр, возвращает 0.
//
Функция ПолучитьТекущийНомерРедакции(ПравилаКонвертацииXSD) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(МАКСИМУМ(РегистрПравилаКонвертацииXSD.НомерРедакции), 0) КАК НомерРедакции
		|ИЗ
		|	РегистрСведений.ПравилаКонвертацииXSD КАК РегистрПравилаКонвертацииXSD
		|ГДЕ
		|	РегистрПравилаКонвертацииXSD.ПравилаКонвертацииXSD = &ПравилаКонвертацииXSD";
	Запрос.УстановитьПараметр("ПравилаКонвертацииXSD", ПравилаКонвертацииXSD);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерРедакции;
	КонецЕсли;
	Возврат 0;
КонецФункции

// Проверяет, что текст правил не записан в регистр.
// Если его нет, то добавляет новую редакцию правил с указанным текстом.
//
//  ПравилаКонвертацииXSD - СправочникСсылка.ПравилаКонвертацииXSD -
//			классификатор правил конвертации XSD.
//  НомерРедакции - Число - сюда будет записан номер редакции.
//

Функция ПроверитьОтсутствиеДобавитьТекстПравилВНовойРедакции(
											ПравилаКонвертацииXSD,
											ТекстПравил) Экспорт
	флЕстьПравила = ЕстьПравила(
		ПравилаКонвертацииXSD,
		Неопределено,
		ПолучитьХэшПравилCRC32(ТекстПравил));
	Если НЕ флЕстьПравила Тогда
		ДобавитьПравилаВНовойРедакции(
			ПравилаКонвертацииXSD,
			ТекстПравил);
	КонецЕсли;
КонецФункции

// Возвращает значение хэша для указанного текста правил.
//
Функция ПолучитьХэшПравилCRC32(ТекстПравил) Экспорт
	Если ТипЗнч(ТекстПравил) <> Тип("Строка") Тогда
		Возврат -1;
	КонецЕсли;
	Хэшер = Новый ХешированиеДанных(ХешФункция.CRC32);
	Хэшер.Добавить(ТекстПравил);
	Возврат	Хэшер.ХешСумма;
КонецФункции


#КонецОбласти


#Область СлужебныеПроцедурыИФункции


Процедура ЗаписатьПравилаВРегистр(ПравилаКонвертацииXSD, НомерРедакции, ТекстПравил)
	МенеджерЗаписи = РегистрыСведений.ПравилаКонвертацииXSD.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПравилаКонвертацииXSD = ПравилаКонвертацииXSD;
	МенеджерЗаписи.НомерРедакции = НомерРедакции;
	МенеджерЗаписи.ТекстПравил = ТекстПравил;
	МенеджерЗаписи.Записать();
КонецПроцедуры


#КонецОбласти


#КонецЕсли
